{
	"@metadata": {
		"authors": [
			"MuratTheTurkish",
			"Nemo bis",
			"Purodha",
			"thibault marin"
		]
	},
	"pgftikz-desc": "{{desc}}",
	"pgftikz-error-title": "Generic title message displayed before the actual reported error",
	"pgftikz-error-emptyinput": "Displayed when parsing input and finding no text between <PGFTikZ> tags.",
	"pgftikz-error-imagelineparse": "Displayed when extraction of filename from image entry line (e.g. [[:File:Filename.png]]) failed.",
	"pgftikz-error-apigetpagecontent": "Displayed when API call to get existing file failed.",
	"pgftikz-error-apiedit": "Displayed when API call failed to edit wikipage associated with uploaded image.",
	"pgftikz-error-apidelete": "Displayed when API call to delete preview wikipage.",
	"pgftikz-error-nonpgffile": "Displayed when a file with the target name was found, but the PGFTikZ header was not found (possibly a non PGFTikZ-generated file).",
	"pgftikz-error-preambleparse": "<PGFTikZPreamble> tags not found in input.",
	"pgftikz-error-tmpdircreate": "Displayed when temporary folder creation failed.",
	"pgftikz-error-texfilecreate": "Error displayed when creation of LaTeX source file failed.",
	"pgftikz-error-latexnoout": "Error displayed when call to LaTeX failed and produced no text output.",
	"pgftikz-error-latexcompil": "Error displayed when call to LaTeX failed to compile (compilation log follows).",
	"pgftikz-error-dvipsnoout": "Error displayed when a call to dvips failed and produced no text output.",
	"pgftikz-error-dvipscompil": "Error displayed when a call to dvips failed to produce image (error message follows).",
	"pgftikz-error-epstoolnoout": "Error displayed when a call to epstool failed and produced no text output.",
	"pgftikz-error-epstoolrun": "Error displayed when a call to epstool failed to produce image (error message follows).",
	"pgftikz-error-convertnoout": "Error displayed when a call to convert (imagemagick) failed and produced no text output.",
	"pgftikz-error-convertrun": "Error displayed when a call to convert (imagemagick) failed to produce an image (error message follows).",
	"pgftikz-error-ghostscriptnoout": "Error displayed when a call to ghostscript failed and produced no text output.",
	"pgftikz-error-ghostscriptrun": "Error displayed when a call to ghostscript failed to produce an image (error message follows).\n\nThe parenthesis \"runtime\" is the technical term for \"when running ghostscript\": you can drop it if there is no such term in your language.",
	"pgftikz-error-uploadlocal_error_empty": "Error displayed when upload failed (empty file).",
	"pgftikz-error-uploadlocal_error_missing": "Error displayed when upload failed (filetype missing).",
	"pgftikz-error-uploadlocal_error_badtype": "Error displayed when upload failed (bad filetype).",
	"pgftikz-error-uploadlocal_error_tooshort": "Error displayed when upload failed (filename too short).",
	"pgftikz-error-uploadlocal_error_illegal": "Error displayed when upload failed (illegal filename).",
	"pgftikz-error-uploadlocal_error_overwrite": "Error displayed when upload failed (trying to overwrite an existing file when disabled by setup).",
	"pgftikz-error-uploadlocal_error_verify": "Error displayed when upload failed (verification error).  $1 gives details on the error.",
	"pgftikz-error-uploadlocal_error_hook": "Error displayed when upload failed (hook aborted).",
	"pgftikz-error-uploadlocal_error_unknown": "Error displayed when upload failed (unknown error)."
}
